Hey @myshon. Thanks for reaching out to us.

There was a change for `is_transient` field described in https://github.com/Snowflake-Labs/terraform-provider-snowflake/blob/main/MIGRATION_GUIDE.md#behavior-change-boolean-type-changes-1 that may be a reason for recreation.

However, any recreation should be marked in the plan output accordingly. Below is an output I see when using the simplified config and moving from 0.89 to 0.97:
0.89.0 config:
```hcl
terraform {
  required_providers {
    snowflake = {
      source  = "Snowflake-Labs/snowflake"
      version = "~> 0.89.0"
    }
  }
}

provider "snowflake" {
}

resource "snowflake_database" "db" {
  name = "ASW_TEST_V089_DB"
}


resource "snowflake_schema" "rag" {
  database = snowflake_database.db.name
  name     = "ASW_TEST_V089_SC"
}

```

0.97.0 config:
```hcl
terraform {
  required_providers {
    snowflake = {
      source  = "Snowflake-Labs/snowflake"
      version = "~> 0.97.0"
    }
  }
}

provider "snowflake" {
}

resource "snowflake_database" "db" {
  name = "ASW_TEST_V089_DB"
}


resource "snowflake_schema" "rag" {
  database = snowflake_database.db.name
  name     = "ASW_TEST_V089_SC"
}

```

Part of plan output (notice the `snowflake_schema.rag must be replaced` and `# forces replacement` parts):
```
➜  issue3336 terraform plan         
snowflake_database.db: Refreshing state... [id=ASW_TEST_V089_DB]
snowflake_schema.rag: Refreshing state... [id="ASW_TEST_V089_DB"."ASW_TEST_V089_SC"]

Terraform used the selected providers to generate the following execution plan.
Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # snowflake_schema.rag must be replaced
-/+ resource "snowflake_schema" "rag" {
      + catalog                                       = (known after apply)
      ~ data_retention_time_in_days                   = 1 -> (known after apply)
      + default_ddl_collation                         = (known after apply)
      ~ describe_output                               = [] -> (known after apply)
      ~ enable_console_output                         = false -> (known after apply)
      + external_volume                               = (known after apply)
      ~ fully_qualified_name                          = "\"ASW_TEST_V089_DB\".\"ASW_TEST_V089_SC\"" -> (known after apply)
      ~ id                                            = "\"ASW_TEST_V089_DB\".\"ASW_TEST_V089_SC\"" -> (known after apply)
      ~ is_transient                                  = "false" -> "default" # forces replacement
      ~ log_level                                     = "OFF" -> (known after apply)
      ~ max_data_extension_time_in_days               = 14 -> (known after apply)
...
```